<details><summary>Digger run report at 2023-10-11 18:17:31 (UTC)</summary>
        <details><summary>Apply for <b>rimvydascivilis/alpha-infra#live_staging_data</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.20.1

Terraform has been successfully initialized!
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

available_azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
  "us-east-1d",
  "us-east-1e",
  "us-east-1f",
])
first_3_azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
])

  ```
</details>

<details><summary>Apply for <b>rimvydascivilis/alpha-infra#live_staging_eks</b></summary>
  
```terraform
Terraform will perform the following actions:

  # module.eks_managed_node_group["general"].aws_eks_node_group.this[0] must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ ami_type               = "AL2_x86_64" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:039454511521:nodegroup/eks-staging/general-2023101116590185050000000e/eec58fd6-b6a1-962c-c04b-481ab39644d9" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "eks-staging:general-2023101116590185050000000e" -> (known after apply)
      ~ instance_types         = [ # forces replacement
          - "t2.micro",
          + "t3.small",
        ]
      - labels                 = {} -> null
      ~ node_group_name        = "general-2023101116590185050000000e" -> (known after apply)
      ~ release_version        = "1.28.1-20231002" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-general-2023101116590185050000000e-eec58fd6-b6a1-962c-c04b-481ab39644d9"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Environment" = "staging"
            "Name"        = "general"
            "Terraform"   = "true"
        }
        # (7 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-07bd5fd8cd491a8bc"
          ~ name    = "general-2023101116590137070000000c" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ scaling_config {
          ~ desired_size = 4 -> 2
            # (2 unchanged attributes hidden)
        }

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ eks_managed_node_groups                          = {
      ~ general = {
          ~ node_group_arn                     = "arn:aws:eks:us-east-1:039454511521:nodegroup/eks-staging/general-2023101116590185050000000e/eec58fd6-b6a1-962c-c04b-481ab39644d9" -> (known after apply)
          ~ node_group_autoscaling_group_names = [
              - "eks-general-2023101116590185050000000e-eec58fd6-b6a1-962c-c04b-481ab39644d9",
            ] -> (known after apply)
          ~ node_group_id                      = "eks-staging:general-2023101116590185050000000e" -> (known after apply)
          ~ node_group_labels                  = {} -> null
          ~ node_group_resources               = [
              - {
                  - autoscaling_groups              = [
                      - {
                          - name = "eks-general-2023101116590185050000000e-eec58fd6-b6a1-962c-c04b-481ab39644d9"
                        },
                    ]
                  - remote_access_security_group_id = ""
                },
            ] -> (known after apply)
          ~ node_group_status                  = "ACTIVE" -> (known after apply)
            # (10 unchanged attributes hidden)
        }
    }
  ~ eks_managed_node_groups_autoscaling_group_names  = [
      - "eks-general-2023101116590185050000000e-eec58fd6-b6a1-962c-c04b-481ab39644d9",
    ] -> (known after apply)
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Creating...
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [10s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [20s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [30s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [40s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [50s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [1m0s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [1m10s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still creating... [1m20s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Creation complete after 1m27s [id=eks-staging:general-20231011181817998200000001]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0] (deposed object 1f3aee10): Destroying... [id=eks-staging:general-2023101116590185050000000e]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 10s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 20s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 30s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 40s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 50s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 1m0s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 1m10s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 1m20s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 1m30s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 1m40s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 1m50s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 2m0s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 2m10s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 2m20s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 2m30s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 2m40s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 2m50s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 3m0s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 3m10s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 3m20s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 3m30s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 3m40s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 3m50s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 4m0s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 4m10s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 4m20s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 4m30s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 4m40s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 4m50s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 5m0s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 5m10s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 5m20s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 5m30s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 5m40s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 5m50s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 6m0s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Still destroying... [id=eks-staging:general-2023101116590185050000000e, 6m10s elapsed]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Destruction complete after 6m20s

Warning: Argument is deprecated

  with aws_eks_addon.this["coredns"],
  on main.tf line 392, in resource "aws_eks_addon" "this":
 392:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")

The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
resource creation. Use "resolve_conflicts_on_create" and/or
"resolve_conflicts_on_update" instead

(and 2 more similar warnings elsewhere)

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

Outputs:

aws_auth_configmap_yaml = <<EOT
apiVersion: v1
kind: ConfigMap
metadata:
  name: aws-auth
  namespace: kube-system
data:
  mapRoles: |
    - rolearn: arn:aws:iam::039454511521:role/general-eks-node-group-20231011164915155300000003
      username: system:node:{{EC2PrivateDNSName}}
      groups:
        - system:bootstrappers
        - system:nodes

EOT
cloudwatch_log_group_arn = "arn:aws:logs:us-east-1:039454511521:log-group:/aws/eks/eks-staging/cluster"
cloudwatch_log_group_name = "/aws/eks/eks-staging/cluster"
cluster_addons = {
  "coredns" = {
    "addon_name" = "coredns"
    "addon_version" = "v1.10.1-eksbuild.4"
    "arn" = "arn:aws:eks:us-east-1:039454511521:addon/eks-staging/coredns/4ac58fd7-a296-b5ec-19e8-5f27eaed6963"
    "cluster_name" = "eks-staging"
    "configuration_values" = ""
    "created_at" = "2023-10-11T17:01:02Z"
    "id" = "eks-staging:coredns"
    "modified_at" = "2023-10-11T17:02:05Z"
    "preserve" = tobool(null)
    "resolve_conflicts" = "OVERWRITE"
    "resolve_conflicts_on_create" = tostring(null)
    "resolve_conflicts_on_update" = tostring(null)
    "service_account_role_arn" = ""
    "tags" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "tags_all" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "timeouts" = {
      "create" = tostring(null)
      "delete" = tostring(null)
      "update" = tostring(null)
    }
  }
  "kube-proxy" = {
    "addon_name" = "kube-proxy"
    "addon_version" = "v1.28.2-eksbuild.2"
    "arn" = "arn:aws:eks:us-east-1:039454511521:addon/eks-staging/kube-proxy/76c58fd7-a29c-22d8-ec24-fa9eba1576bc"
    "cluster_name" = "eks-staging"
    "configuration_values" = ""
    "created_at" = "2023-10-11T17:01:02Z"
    "id" = "eks-staging:kube-proxy"
    "modified_at" = "2023-10-11T17:01:29Z"
    "preserve" = tobool(null)
    "resolve_conflicts" = "OVERWRITE"
    "resolve_conflicts_on_create" = tostring(null)
    "resolve_conflicts_on_update" = tostring(null)
    "service_account_role_arn" = ""
    "tags" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "tags_all" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "timeouts" = {
      "create" = tostring(null)
      "delete" = tostring(null)
      "update" = tostring(null)
    }
  }
  "vpc-cni" = {
    "addon_name" = "vpc-cni"
    "addon_version" = "v1.15.0-eksbuild.2"
    "arn" = "arn:aws:eks:us-east-1:039454511521:addon/eks-staging/vpc-cni/cac58fd7-a293-e81a-2b5d-c6e72bc303a7"
    "cluster_name" = "eks-staging"
    "configuration_values" = ""
    "created_at" = "2023-10-11T17:01:02Z"
    "id" = "eks-staging:vpc-cni"
    "modified_at" = "2023-10-11T17:02:00Z"
    "preserve" = tobool(null)
    "resolve_conflicts" = "OVERWRITE"
    "resolve_conflicts_on_create" = tostring(null)
    "resolve_conflicts_on_update" = tostring(null)
    "service_account_role_arn" = ""
    "tags" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "tags_all" = tomap({
      "Environment" = "staging"
      "Terraform" = "true"
    })
    "timeouts" = {
      "create" = tostring(null)
      "delete" = tostring(null)
      "update" = tostring(null)
    }
  }
}
cluster_arn = "arn:aws:eks:us-east-1:039454511521:cluster/eks-staging"
cluster_certificate_authority_data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJWnprQkVHRVJoUmt3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TXpFd01URXhOalE1TkRsYUZ3MHpNekV3TURneE5qVTBORGxhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUM2UzlxVHhaTTRzcmxXd3ZDK2U2WDM1Qi91Wk4yMWFyckw2NzhYZ09wdkllVTNrNVNoOUljMmVWYkEKd0FkOUNBczhyMUdBQWF3dVBkcm1VSCtBWlMycGdJTWcwaTludkpmYTJ6U0pPM0VLR0dzTXh4SFcwRkVYZWptdQpqd25NV2cwamt3WThuY3hHOE44VzZ0K2tjV0FpMGJTR2tTa2JnVlZvTGF0SngyZ2FkVU5waXhZSDdQMmJ0VWVlCjdvajRSZ1Y4MFp0Ums2dkhQUndqUWV0Qk5EWmh0d1R1Y0dxbmFoWCtuQi9HVFdDNVJMM25ZREMxa1oyeFg0RlkKK2dScXVTOVEyZFkwMzFJTWczUzlWbXVna25oa3hYQTRSa2FSbWFPdjFTa1dxTlJ1YkQxd1VWREI2SHFHSFM5WgplU2k4VUUzcXhHMllBZW1LVDQ0V3h3RURiWk1sQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJSY2ZVaFB4ckxVa09ldndjeUF5a0Y4djVob2ZqQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQW1zSy8vQlRxRApleWFyQm1sTG15Sk9reWVnSnBnMGZkRFp0SG9vR0R5M1RCbXpEci9VK1gwMzQrU2Jva0x4TlBNR1dwL0E2V0xJCmpnRWxaM0VVdDY1bkxJR1EyM3BiY0dMQUNESmJ3UzdnQi80U1FFT2Qxc0t0NFpLbm40eFJoWk12anMzbDFTMkwKa2ZVNzVSOEprZUEvZUtPcitCYlV6WXN2QWtSdUZGSHBHU01DalVadUxqTUhuc2lCYUpJeXF3NWV6QStZQVc1UAoyV3VxV3ptem1SZkYzQUZlUzBQa0hVMDVhaVl6eEV0Q3JYTmttejNyazMzbEpwVG9Nb29VUXNqQmVLRTRkTGZwCmo4MUU4eXVqNktyTjUrSEtBdUhidUxMOVJyL3B3Nm52aXBMRHVJR3M2WkNiZmVlSmp6OHhERWQvSjVOTWFKNDYKd3NNbkphb0NMVGo3Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
cluster_endpoint = "https://877735BD0CC41F98DFC900004ABF1953.gr7.us-east-1.eks.amazonaws.com"
cluster_iam_role_arn = "arn:aws:iam::039454511521:role/eks-staging-cluster-20231011164915155600000004"
cluster_iam_role_name = "eks-staging-cluster-20231011164915155600000004"
cluster_iam_role_unique_id = "AROAQSL5MCGQRIJ2PVGNR"
cluster_identity_providers = {}
cluster_name = "eks-staging"
cluster_oidc_issuer_url = "https://oidc.eks.us-east-1.amazonaws.com/id/877735BD0CC41F98DFC900004ABF1953"
cluster_platform_version = "eks.1"
cluster_primary_security_group_id = "sg-0d8a01d0fbc0e26cf"
cluster_security_group_arn = "arn:aws:ec2:us-east-1:039454511521:security-group/sg-07e4c9bc30faaed5b"
cluster_security_group_id = "sg-07e4c9bc30faaed5b"
cluster_status = "ACTIVE"
cluster_tls_certificate_sha1_fingerprint = "9e99a48a9960b14926bb7f3b02e22da2b0ab7280"
cluster_version = "1.28"
eks_managed_node_groups = {
  "general" = {
    "autoscaling_group_schedule_arns" = {}
    "iam_role_arn" = "arn:aws:iam::039454511521:role/general-eks-node-group-20231011164915155300000003"
    "iam_role_name" = "general-eks-node-group-20231011164915155300000003"
    "iam_role_unique_id" = "AROAQSL5MCGQ5X7L2AWVL"
    "launch_template_arn" = "arn:aws:ec2:us-east-1:039454511521:launch-template/lt-07bd5fd8cd491a8bc"
    "launch_template_id" = "lt-07bd5fd8cd491a8bc"
    "launch_template_latest_version" = 1
    "launch_template_name" = "general-2023101116590137070000000c"
    "node_group_arn" = "arn:aws:eks:us-east-1:039454511521:nodegroup/eks-staging/general-20231011181817998200000001/58c58ffb-012f-2b41-3a10-d9d12b659b0c"
    "node_group_autoscaling_group_names" = [
      "eks-general-20231011181817998200000001-58c58ffb-012f-2b41-3a10-d9d12b659b0c",
    ]
    "node_group_id" = "eks-staging:general-20231011181817998200000001"
    "node_group_labels" = tomap(null) /* of string */
    "node_group_resources" = tolist([
      {
        "autoscaling_groups" = tolist([
          {
            "name" = "eks-general-20231011181817998200000001-58c58ffb-012f-2b41-3a10-d9d12b659b0c"
          },
        ])
        "remote_access_security_group_id" = ""
      },
    ])
    "node_group_status" = "ACTIVE"
    "node_group_taints" = toset([])
    "platform" = "linux"
  }
}
eks_managed_node_groups_autoscaling_group_names = tolist([
  "eks-general-20231011181817998200000001-58c58ffb-012f-2b41-3a10-d9d12b659b0c",
])
fargate_profiles = {}
kms_key_arn = "arn:aws:kms:us-east-1:039454511521:key/202bb6f6-f01f-4a1a-b28d-c5812f52735d"
kms_key_id = "202bb6f6-f01f-4a1a-b28d-c5812f52735d"
kms_key_policy = "{\"Statement\":[{\"Action\":[\"kms:Update*\",\"kms:UntagResource\",\"kms:TagResource\",\"kms:ScheduleKeyDeletion\",\"kms:Revoke*\",\"kms:Put*\",\"kms:List*\",\"kms:Get*\",\"kms:Enable*\",\"kms:Disable*\",\"kms:Describe*\",\"kms:Delete*\",\"kms:Create*\",\"kms:CancelKeyDeletion\"],\"Effect\":\"Allow\",\"Principal\":{\"AWS\":\"arn:aws:iam::039454511521:user/rimvydas\"},\"Resource\":\"*\",\"Sid\":\"KeyAdministration\"},{\"Action\":[\"kms:ReEncrypt*\",\"kms:GenerateDataKey*\",\"kms:Encrypt\",\"kms:DescribeKey\",\"kms:Decrypt\"],\"Effect\":\"Allow\",\"Principal\":{\"AWS\":\"arn:aws:iam::039454511521:role/eks-staging-cluster-20231011164915155600000004\"},\"Resource\":\"*\",\"Sid\":\"KeyUsage\"}],\"Version\":\"2012-10-17\"}"
node_security_group_arn = "arn:aws:ec2:us-east-1:039454511521:security-group/sg-0711082bd945cb9be"
node_security_group_id = "sg-0711082bd945cb9be"
oidc_provider = "oidc.eks.us-east-1.amazonaws.com/id/877735BD0CC41F98DFC900004ABF1953"
oidc_provider_arn = "arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/877735BD0CC41F98DFC900004ABF1953"
self_managed_node_groups = {}
self_managed_node_groups_autoscaling_group_names = tolist([])

  ```
</details>


<details><summary>Apply for <b>rimvydascivilis/alpha-infra#live_staging_k8s-addons</b></summary>
  
```terraform
Terraform will perform the following actions:

  # helm_release.argocd[0] is tainted, so must be replaced
-/+ resource "helm_release" "argocd" {
      ~ id                         = "argocd" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version = "v2.8.4"
              - chart       = "argo-cd"
              - name        = "argocd"
              - namespace   = "argocd"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - global = {
                          - image = {
                              - tag = "v2.8.4"
                            }
                        }
                      - server = {
                          - extraArgs = [
                              - "--insecure",
                            ]
                          - ingress   = {
                              - annotations = {
                                  - "alb.ingress.kubernetes.io/group.name"  = "default"
                                  - "alb.ingress.kubernetes.io/group.order" = 1
                                  - "alb.ingress.kubernetes.io/scheme"      = "internet-facing"
                                }
                              - enabled     = true
                              - hosts       = [
                                  - "argocd.staging.example.com",
                                ]
                              - paths       = [
                                  - "/",
                                ]
                            }
                          - service   = {
                              - type = "NodePort"
                            }
                        }
                    }
                )
              - version     = "5.46.7"
            },
        ] -> (known after apply)
        name                       = "argocd"
      ~ status                     = "failed" -> "deployed"
        # (25 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
helm_release.argocd[0]: Destroying... [id=argocd]
helm_release.argocd[0]: Destruction complete after 4s
helm_release.argocd[0]: Creating...
helm_release.argocd[0]: Still creating... [10s elapsed]
helm_release.argocd[0]: Still creating... [20s elapsed]
helm_release.argocd[0]: Still creating... [30s elapsed]
helm_release.argocd[0]: Creation complete after 38s [id=argocd]

Warning: Helm uninstall returned an information message

These resources were kept due to the resource policy:
[CustomResourceDefinition] applications.argoproj.io
[CustomResourceDefinition] applicationsets.argoproj.io
[CustomResourceDefinition] appprojects.argoproj.io


Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

  ```
</details>


<details><summary>Apply for <b>rimvydascivilis/alpha-infra#live_staging_vpc</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.20.1

Terraform has been successfully initialized!
aws_vpc.this[0]: Refreshing state... [id=vpc-0b06587589003f692]
aws_default_security_group.this[0]: Refreshing state... [id=sg-08e02bfd5e35a65ba]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-05e0896259da39a35]
aws_route_table.intra[0]: Refreshing state... [id=rtb-0826a7465497b63b4]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-0376435ce8eaec99a]
aws_subnet.private[0]: Refreshing state... [id=subnet-097e8b49199a9589c]
aws_subnet.private[2]: Refreshing state... [id=subnet-0fd8af2e73e3eca63]
aws_subnet.intra[0]: Refreshing state... [id=subnet-03fd5e3083552f5a7]
aws_subnet.intra[1]: Refreshing state... [id=subnet-0006896ff4a4fc9a7]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f44dc54ec260b934]
aws_subnet.private[1]: Refreshing state... [id=subnet-0ea0a6020a9ea2267]
aws_subnet.intra[2]: Refreshing state... [id=subnet-080198afe05465cd5]
aws_subnet.public[0]: Refreshing state... [id=subnet-082930781bc71f66e]
aws_subnet.public[1]: Refreshing state... [id=subnet-069bcbb444187b8d3]
aws_subnet.public[2]: Refreshing state... [id=subnet-061f8c01800fe4990]
aws_route_table.private[0]: Refreshing state... [id=rtb-0368c49be9635d56a]
aws_route_table.public[0]: Refreshing state... [id=rtb-0e2043b6155953690]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-0e3dc6a4c9b106e17]
aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-0dfd6713086173fa3]
aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-0f9a069cb51db9c81]
aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-05b7210f51844a3ac]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e2043b61559536901080289494]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02c612d760080871b]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f12120e316c6ce2f]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-01202d470ffc9d65c]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0d2aa74617772bf89]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-033b8224cd7391f4d]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c4d2e356010404e6]
aws_nat_gateway.this[0]: Refreshing state... [id=nat-0301ab814236b6ce7]
aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0368c49be9635d56a1080289494]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
])
cgw_arns = []
cgw_ids = []
database_nat_gateway_route_ids = []
database_route_table_association_ids = []
database_route_table_ids = tolist([
  "rtb-0368c49be9635d56a",
])
database_subnet_arns = []
database_subnets = []
database_subnets_cidr_blocks = tolist([])
database_subnets_ipv6_cidr_blocks = tolist([])
default_network_acl_id = "acl-0376435ce8eaec99a"
default_route_table_id = "rtb-05e0896259da39a35"
default_security_group_id = "sg-08e02bfd5e35a65ba"
elasticache_route_table_association_ids = []
elasticache_route_table_ids = [
  "rtb-0368c49be9635d56a",
]
elasticache_subnet_arns = []
elasticache_subnets = []
elasticache_subnets_cidr_blocks = tolist([])
elasticache_subnets_ipv6_cidr_blocks = tolist([])
igw_arn = "arn:aws:ec2:us-east-1:039454511521:internet-gateway/igw-0f44dc54ec260b934"
igw_id = "igw-0f44dc54ec260b934"
intra_route_table_association_ids = [
  "rtbassoc-0dfd6713086173fa3",
  "rtbassoc-05b7210f51844a3ac",
  "rtbassoc-0f9a069cb51db9c81",
]
intra_route_table_ids = [
  "rtb-0826a7465497b63b4",
]
intra_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-03fd5e3083552f5a7",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0006896ff4a4fc9a7",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-080198afe05465cd5",
]
intra_subnets = [
  "subnet-03fd5e3083552f5a7",
  "subnet-0006896ff4a4fc9a7",
  "subnet-080198afe05465cd5",
]
intra_subnets_cidr_blocks = tolist([
  "10.0.6.0/24",
  "10.0.7.0/24",
  "10.0.8.0/24",
])
intra_subnets_ipv6_cidr_blocks = tolist([])
name = "vpc-staging"
nat_ids = [
  "eipalloc-0e3dc6a4c9b106e17",
]
nat_public_ips = tolist([
  "3.221.38.143",
])
natgw_ids = [
  "nat-0301ab814236b6ce7",
]
outpost_subnet_arns = []
outpost_subnets = []
outpost_subnets_cidr_blocks = tolist([])
outpost_subnets_ipv6_cidr_blocks = tolist([])
private_ipv6_egress_route_ids = []
private_nat_gateway_route_ids = [
  "r-rtb-0368c49be9635d56a1080289494",
]
private_route_table_association_ids = [
  "rtbassoc-02c612d760080871b",
  "rtbassoc-0f12120e316c6ce2f",
  "rtbassoc-01202d470ffc9d65c",
]
private_route_table_ids = [
  "rtb-0368c49be9635d56a",
]
private_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-097e8b49199a9589c",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0ea0a6020a9ea2267",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-0fd8af2e73e3eca63",
]
private_subnets = [
  "subnet-097e8b49199a9589c",
  "subnet-0ea0a6020a9ea2267",
  "subnet-0fd8af2e73e3eca63",
]
private_subnets_cidr_blocks = tolist([
  "10.0.0.0/24",
  "10.0.1.0/24",
  "10.0.2.0/24",
])
private_subnets_ipv6_cidr_blocks = tolist([])
public_internet_gateway_route_id = "r-rtb-0e2043b61559536901080289494"
public_route_table_association_ids = [
  "rtbassoc-033b8224cd7391f4d",
  "rtbassoc-0c4d2e356010404e6",
  "rtbassoc-0d2aa74617772bf89",
]
public_route_table_ids = [
  "rtb-0e2043b6155953690",
]
public_subnet_arns = [
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-082930781bc71f66e",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-069bcbb444187b8d3",
  "arn:aws:ec2:us-east-1:039454511521:subnet/subnet-061f8c01800fe4990",
]
public_subnets = [
  "subnet-082930781bc71f66e",
  "subnet-069bcbb444187b8d3",
  "subnet-061f8c01800fe4990",
]
public_subnets_cidr_blocks = tolist([
  "10.0.3.0/24",
  "10.0.4.0/24",
  "10.0.5.0/24",
])
public_subnets_ipv6_cidr_blocks = tolist([])
redshift_public_route_table_association_ids = []
redshift_route_table_association_ids = []
redshift_route_table_ids = tolist([
  "rtb-0368c49be9635d56a",
])
redshift_subnet_arns = []
redshift_subnets = []
redshift_subnets_cidr_blocks = tolist([])
redshift_subnets_ipv6_cidr_blocks = tolist([])
this_customer_gateway = {}
vpc_arn = "arn:aws:ec2:us-east-1:039454511521:vpc/vpc-0b06587589003f692"
vpc_cidr_block = "10.0.0.0/16"
vpc_enable_dns_hostnames = true
vpc_enable_dns_support = true
vpc_flow_log_cloudwatch_iam_role_arn = ""
vpc_flow_log_destination_arn = ""
vpc_flow_log_destination_type = "cloud-watch-logs"
vpc_id = "vpc-0b06587589003f692"
vpc_instance_tenancy = "default"
vpc_ipv6_association_id = ""
vpc_ipv6_cidr_block = ""
vpc_main_route_table_id = "rtb-05e0896259da39a35"
vpc_owner_id = "039454511521"
vpc_secondary_cidr_blocks = tolist([])

  ```
</details>

</details>